In [14]:
import pandas as pd
import numpy as np

apples = pd.Series([3,2,0,1])
oranges = pd.Series([3,4,7,8])

In [15]:
state = ['ohio', 'Ohio', 'Ohio', 'Naveda', 'Naveda', 'Naveda']
data = {'state': state ,
        'year' : [2000,2001,2002,2001,2002,2003],
        'pop'  : [1.5,1.7,3.6, 2.4, 2.9, 3.2]}
state_pop_df = pd.DataFrame(data
                    , index = ['1st', '2nd', '3rd',
                               '4th', '5th', '6th'])
print(state_pop_df.head())

      state  year  pop
1st    ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Naveda  2001  2.4
5th  Naveda  2002  2.9

In [10]:
state_pop_df['debt'] = 16.5

In [12]:
state_pop_df

      state  year  pop  debt
1st    ohio  2000  1.5  16.5
2nd    Ohio  2001  1.7  16.5
3rd    Ohio  2002  3.6  16.5
4th  Naveda  2001  2.4  16.5
5th  Naveda  2002  2.9  16.5
6th  Naveda  2003  3.2  16.5

In [17]:
ln = len(state_pop_df)
rng = np.arange(ln)
state_pop_df['debt'] = rng
state_pop_df

      state  year  pop  debt
1st    ohio  2000  1.5     0
2nd    Ohio  2001  1.7     1
3rd    Ohio  2002  3.6     2
4th  Naveda  2001  2.4     3
5th  Naveda  2002  2.9     4
6th  Naveda  2003  3.2     5

In [27]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 3, 6])
# obj3
# print( obj3 )
# might create a new rows
obj3 =obj3.reindex(range(9) )
print(obj3)
# obj3 =obj3.reindex(range(9), method='ffill' )
# print(obj3)
# obj3 =obj3.reindex(range(2,11), method="bfill")
# pd.DataFrame(obj3 , columns= ['number'])

0      blue
1       NaN
2       NaN
3    purple
4       NaN
5       NaN
6    yellow
7       NaN
8       NaN
dtype: object

In [37]:
states = pd.DataFrame(np.arange(9).reshape((3, 3) ),
index=['b', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

states
# for your own working, run following statement without ffill
states = states.reindex(['a', 'b', 'c', 'd'],method = 'bfill')
# states = states.reindex(['a', 'b', 'c', 'd'])

states

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [40]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")

# dataframe.drop method would return a new dataframe without 
# having deleted rows. so store its into to dataframe variable
# or use inplace=True while droping rows or column

#data_df.drop(['Colorado', 'Ohio'], inplace =True)
#print(data_df)

#You can drop values from the columns by passing axis=1 
#or axis='columns' :
# data_df = data_df.drop('two', axis=1)
# data_df.drop('two', axis=1, inplace = True)
data_df.drop('two', axis=1)
print(data_df)

# if i want to remove a row for example 'Colorado', 
# how can we do that

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15